Revit.GeometryConversion.PolygonContainment.GetQuadrant(Autodesk.Revit.DB.UV,Autodesk.Revit.DB.UV)
Determine the quadrant of a polygon vertex
relative to the test point.

Revit.GeometryConversion.PolygonContainment.GetXIntercept(Autodesk.Revit.DB.UV,Autodesk.Revit.DB.UV,System.Double)
Determine the X intercept of a polygon edge
with a horizontal line at the Y value of the
test point.

Revit.GeometryConversion.PolygonContainment.PolygonContains(System.Collections.Generic.List{Autodesk.Revit.DB.UV},Autodesk.Revit.DB.UV)
Determine whether given 2D point lies within
the polygon.
Written by Jeremy Tammik, Autodesk, 2009-09-23,
based on code that I wrote back in 1996 in C++,
which in turn was based on C code from the
article "An Incremental Angle Point in Polygon
Test" by Kevin Weiler, Autodesk, in "Graphics
Gems IV", Academic Press, 1994.
Copyright (C) 2009 by Jeremy Tammik. All
rights reserved.
This code may be freely used. Please preserve
this comment.